app/controllers/todos_controller.rb

  def index
    render json: Todo.where(user_id: @user.id)
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 1]]

  def create
    render json: @user.todos.create!(due_date: @due_date)
---
INSERT INTO "todos" ("due_date", "user_id", "workflow_state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["due_date", "2015-09-12"], ["user_id", 1], ["workflow_state", "started"], ["created_at", "2015-08-17 18:35:07.322871"], ["updated_at", "2015-08-17 18:35:07.322871"]]

    def set_todo
      @todo = Todo.find(params[:id].to_i) if params[:id].present?
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 2]]