app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-08-17 18:29:29.989306"], ["updated_at", "2015-08-17 18:29:29.989306"]]
---
  def create
    render json: User.create!